#include <stdio.h>

int main() {
    printf("Hello, World!\n");
    return 0;
}



//1. Описать функцию, возвращающую строку с двоичным представлением положительного целого десятичного числа,
// переданного в аргументе этой функции.
//
//2. Описать структуру "прямоугольник", содержащую целочисленные значения длины, ширины, периметра
// и площади прямоугольника. Написать функцию, принимающую на вход указатель на структуру,
// подсчитывающую и записывающую площадь и периметр данного прямоугольника в структуру.
//
//3. Описать структуру "прямая линия" которая должна состоять из длины и двух внутренних структур типа "точка",
// в каждой из которых должны содержаться координаты по оси 'х' и по оси 'у'. Описать функцию принимающую на вход
// координаты двух точек, и возвращающую структуру "линия" с подсчитанной длиной.
//
//4. (необязательно) Написать функцию-обёртку, принимающую указатель на область памяти,
// которую затем можно использовать как двумерный массив из элементов типа integer.
// Количество элементов указывается в аргументе функции. Массив должен быть гарантированно инициализирован нулями.
// Для проверки - заполните этот массив и выведите на экран.
