/* Автор: Куликов Алексей */
/*  Среда разработки: JetBrains Clion */

/* библиотеки */
#include <stdio.h>
#include <math.h>

/* переменные */

/* основной цикл */
int main() {
    printf("Hello, World!\n");
    return 0;
}


//Практическая работа принимается в виде одного файла .с с одной программой,
// выполняющей все действия, предусмотренные заданиями.

//1 Запросить у пользователя целое число. Написать программу которая проверит,
// входит ли введённое число в диапазон от 0 до 100, включительно, и выведет на экран
// сообщение о результате проверки.

//2 Запросить у пользователя десять целых чисел (int). Вывести на экран среднее
// арифметическое введённых пользователем чисел.

//3 Запросить у пользователя положительное число не больше 1000
// (переспрашивать, в случае ошибки ввода) и вывести на экран через запятую все положительные
// чётные числа до указанного пользователем, включительно.

//4 Запросить у пользователя количество используемых для вывода строк.
// Написать программу, которая при помощи циклов и символа ^ будет рисовать
// на указанном количестве строк равнобедренный треугольник.

